/**
 * Created by EX-ZHONGWEIMING001 on 2016-08-25.
 */
/**
 * @author: xiaochaofeng090@pingan.com.cn
 * @date  : 2016-02-29
 * @time  : 下午16:00
 * @describe: papc-下拉框列表
 */
define([], function () {
    'use strict';

    return {
        // 国籍
        '1': {
            '1':'中国',
            '2':'香港',
            '3':'澳门',
            '4':'台湾',
            '5':'其他外籍'
        },
        // 国籍 - 其他外籍
        '1_1': '5',
        // 身份证类型
        '2': {
            '1': '身份证',
            '2': '港澳居民通行证',
            '3': '台湾居民通行证',
            '4': '护照',
            '5': '其他'
        },
        '2_1': '1',
        '2_2': '2',
        // 证件有限日期类型
        '3': {
            '1':'长期',
            '0':'日期'
        },
        '3_1':'1',
        '3_2':'0',
        // 性别
        '4': {
            '1':'男',
            '2':'女'
        },
        // 未婚婚姻状况
        '5': {
            '1':'未婚',
            '3':'离婚',
            '4':'丧偶'
        },
        // 已婚婚姻状况
        '5_1': {
            '2':'已婚'
        },
        // 婚姻状况 (共同借款人和担保人)
        '5_2': {
            '1':'未婚',
            '2':'已婚',
            '3':'离婚',
            '4':'丧偶'
        },
        // 婚姻状况 已婚
        '5_3': '2',
        // 雇佣类型
        '6': {
            '1':'自雇',
            '2':'受薪'
        },
        '6_1':'1',//自雇
        '6_2':'2',//受薪
        // 工作单位所属行业
        '7': {
            '101': '教育业',
            '102': '水利、环境和公共设施管理业',
            '103': '租赁和商务服务业',
            '104': '住宿和餐饮业',
            '105': '批发和零售业',
            '106': '建筑业',
            '107': '信息传输、计算机服务和软件业',
            '108': '房地产业',
            '109': '科学研究、技术服务和地质勘查业',
            '110': '居民服务和其他服务业',
            '111': '卫生、社会保障和社会福利业',
            '112': '文化、体育和娱乐业',
            '113': '公共管理和社会组织',
            '114': '农、林、牧、渔业',
            '115': '采矿业',
            '116': '制造业',
            '117': '电力、燃气及水的生产和供应业',
            '118': '交通运输、仓储和邮政业',
            '119': '金融业',
            '120': '国际组织',
            '199': '其他'
        },
        // 职业名称
        '8': {
            '201': '国家机关处级及以上',
            '202': '国家机关处级以下',
            '203': '企业高级管理人员',
            '204': '企业中级管理人员',
            '205': '企业基层管理人员',
            '206': '自营专业技术人员',
            '207': '受雇专业技术人员',
            '208': '私营业主',
            '209': '个体业主',
            '210': '文员',
            '211': '工人',
            '212': '学生',
            '213': '离/退休',
            '214': '军/警',
            '215': '家庭主妇',
            '216': '农民',
            '217': '失业',
            '299': '其他'
        },
        // 与主借款人关系
        '9': {
            '2':'父母',
            '3':'子女',
            '4':'兄弟姐妹',
            '5':'其他'
        },
        // 与主借款人关系 配偶
        '9_1': '1',//  '1':'配偶',
        // 与主借款人关系 其他
        '9_2': '5',
        // 房屋类型 住宅/独栋别墅/联排别墅/双拼（双证） 上海地区增加“学区房”、“老洋房”、“老公房”
        '10': {
            '1': '住宅',
            '2': '双拼（双证)',
            '4': '独栋别墅',
            '5': '联排别墅',
            /* '3': '学区房',
             '11': '老洋房',
             '12': '老公房'*/
            '11': '老洋房',
            '16': '内环内老公房',
            '17': '中环内学区房'
        },
        '10_1': {
            '1': '住宅',
            '2': '双拼（双证)',
            '4': '独栋别墅',
            '5': '联排别墅'
        },
        // 南京、苏州、无锡增加“学区房”
        '10_2':{
            '1': '住宅',
            '2': '双拼（双证)',
            '4': '独栋别墅',
            '5': '联排别墅',
            '3' : '学区房'
        },
        // 房屋分类
        '11': {
            '1': '普通',
            '2': '非普通'
        },
        // 卖方权证类型
        '12': {
            '1': '房屋所有权证',
            '2': '土地使用权证',
            '3': '共有权证',
            '4': '他项权证'
        },
        '12_1':'1',
        // 还款方式-商贷
        '13': {
            '1': '等额还款',
            '2': '等本还款',
            '7': '等额双周供',
            '8': '等本双周供'
        },
        // 还款方式-公积金
        '14': {
            '1': '等额还款',
            '2': '等本还款'
        },
        // 有无
        '15':{
            '1':'有',
            '2':'无'
        },
        //有
        '15_1':'1',
        //无
        '15_2':'2',
        // 是否
        '16':{
            '1':'是',
            '2':'否'
        },
        // 组合贷款
        '17':{
            '1':'组合贷款',
            '2':'非组合贷款'
        },
        // 针对不同城市 显示不同的房屋类型
        '18':['310100'],
        // 针对不显示公积金的城市 厦门、郑州、成都、北京、东莞、合肥、宁波、苏州、天津、重庆,无锡分行暂不支持公积金贷款；
        '19':['350200','410100','510100','110100','441900','340100','330200','320500','120100','500100','320200'],
        //上海所在房产位置
        '20':{
            '01':'内环内',
            '02':'内环到外环',
            '03':'外环外'
        },
        // 江苏省城市（房屋类型增加‘学区房’）
        '21':['320100','320200','320500']
    }
});
